jet_in_flow/4_icoFoamColored_laminar_nonmixing/U1_0_6_U2_0_1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|  fvSolution for icoFoamColored (laminar, two tracers cA/cB)                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }
    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    // --- Tracer cA
    cA
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
    }
    cAFinal
    {
        $cA;
        relTol          0;
    }

    // --- Tracer cB
    cB
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
    }
    cBFinal
    {
        $cB;
        relTol          0;
    }
}

PISO
{
    nCorrectors                 2;
    nNonOrthogonalCorrectors    2;
    // momentumPredictor true/false wird vom Solver gelesen; Standard passt
}

